#include <stdio.h>
#include <locale.h>


int main(void)
{
    setlocale(LC_ALL, "Rus"); /*Устанавливаем русский язык*/

    double a = 0, b = 0, c = 0, D2 = 0, D = 0, x1 = 0 , x2 = 0 ; /*a, b, c - коэффициенты уравнения.
    D2 - дискриминант в квадрате. D - дискриминант. x1, x2 - корни уравнения.*/

    printf("Введите через пробел коэффициенты квадратного уравнения:\n");
    scanf("%lf %lf %lf", &a, &b, &c);

    /*Находим квадрат дискриминанта*/
    D2 = b * b - 4 * a * c;

    /*Линейное уравнение*/
    if (a == 0 & b != 0) {
        x1 = -c / b;
        printf("x = %f.", x1);
    /*Все 0*/
    } else if (a == 0 & b == 0 & c == 0) {
        printf("Решением является любое число");
    /*Невозможное уравнение*/
     } else if (a == 0 & b == 0 & c != 0) {
          printf("Уравнение не имеет решений!\n\n\n");
     /*Дискриминант больше 0*/
    } else if (D2 > 0) {
        D = sqrt(D2);
        x1 = (-b + D) / (2 * a);
        x2 = (-b - D) / (2 * a);
        printf("x1 = %f. x2 = %f", x1, x2);
    /*Дискриминант равен 0*/
    } else if (D2 == 0) {
        D = sqrt(D2);
        x1 = (-b + D) / (2 * a);
        x2 = x1;
        printf("x1 = %f. x2 = %f", x1, x2);
     /*Нет решений*/
    } else {
        printf("Уравнение не имеет решений!\n\n\n");
    }
    return 0;
}
