#include <stdio.h>
#include <locale.h>


int main(void)
{
    setlocale(LC_ALL, "Rus"); /*Устанавливаем русский язык*/

    double a = 0, b = 0, c = 0, D2 = 0, D = 0, x1 = 0 , x2 = 0 ; /*a, b, c - коэффициенты уравнения.
    D2 - дискриминант в квадрате. D - дискриминант. x1, x2 - корни уравнения.*/

    printf("Введите коэффициенты квадратного уравнения:\n");

/**/

/*Находим квадрат дискриминанта*/
    D2 = b * b - 4 * a * c;

/*Проверка исключений*/
    if (D2 > 0) {   /*Дискриминант больше 0*/
        D = sqrt(D2);
        x1 = (-b + D) / (2 * a);
        x2 = (-b - D) / (2 * a);
        printf("x1 = %f. x2 = %f", x1, x2);
    }else if (D2 == 0) {    /*Дискриминант равен 0*/
        D = sqrt(D2);
        x1 = (-b + D) / (2 * a);
        x2 = x1;
        printf("x1 = %f. x2 = %f", x1, x2);
    }else { /*Нет решений*/
        printf("Уравнение не имеет решений!\n\n\n"); /*Добавить 0*/
    }
    return 0;
}



